[
    {
        "title": "How did Hanuman get his name?",
        "description": "This is a story about how Lord Hanuman got his name.",
        "story": "Lord Hanuman is an important God as far as Hinduism is concerned.He is one of the Chiranjeevis or the immortals.Apart from his most popular name Hanuman, he is also known as Anjaneya (Son of Anjana), Maruti (Son of Marut, the Wind God),Bajrang Bali (the strong one who has limbs as hard as the Vajra) etc.We may wonder why he was named as Hanuman. There are many stories regarding this. One of them is shown below :-When Hanuman was a child, he mistook the Sun as a fruit and flew towards it to devour it. When he devoured the Sun, darkness prevailed everywhere and all were worried. Seeing this, Lord Indra came to the rescue of the Sun and hit Hanuman with his weapon Vajra.Hanuman was hit by Vajra on his jaw (Hanu or हनु in Sanskrit). As a result, his jaw got disfigured or inflamed. That is how he got the name “Hanuman” that means one with a prominent or disfigured ",
        "moral": "Moral"
    },
    {
        "title": "Vishnu's Mydrid Kurma Avatar",
        "description": "The churning of the milk ocean, called samudra manthanam, is an important Hindu myth that has many eternal social and spiritual lessons.",
        "story": "This event occurs in the context of Lord Vishnu’s kUrmAvatAra (the descent in the form of a giant turtle).  In the old golden mythical age of kRta yuga when the devas (the “good guys”) and the asuras (the “bad guys”) were young and always fighting for supremacy over the administration of the universe, they both found out that they were equally matched in strength and talent. So for a long time, no party was permanently victorious. So after one of these battles, the devas were ousted from their capital city in heaven amaravatI and it was occupied by the asuras.So, the devas went to Lord Brahma for advice. Brahma (despite being the creator of the entire universe) advised them to go visit Lord Vishnu, so they all went to visit Lord Vishnu at his residence on the milk ocean (ksheer sagar). Vishnu comes up with the idea that the milk ocean should be churned, which would then yield the nectar of immortality (amRtam) which would make the devas invincible. Then they would be able to definitively defeat the asuras.The devas were excited to hear about this idea. However, Vishnu said there was a caveat — they couldn’t churn the ocean by themselves. They had to work out a truce with the asuras to collaborate on this massive undertaking. So Indra sent a messenger to Virocana, the leader of the asuras detailing the plan and asking for collaboration. Some of the senior asura leaders were completely opposed to the plan as they could smell something fishy in this sudden proposal for peace. However, the majority of them thought this might be a good idea, as they might be able to negotiate some deal for their contribution. So it was all set. The devas and asuras would churn the milk ocean as a team. However, they needed a “churning rod” and a rope to churn with.Vishnu again came up with the idea to use mandara mountain as the churning rod, and the serpent king vAsuki as the rope. So they uprooted the mountain and set it in the ocean. But it took a lot more to convince the serpent to participate. He was rightly concerned that this task would kill him because of the rubbing against the mountain. Vishnu reassured him that his body would not be harmed and he would also get a portion of the nectar for his effort. With vAsuki also committed to the task, everything was set in motion.Vishnu, thinking ahead, also managed to get the devas positioned on the tail end of the serpent so that they would be spared the venom spewing from the mouths of the serpent.Soon after they started churning they found out that the weight of the mountain was causing it to sink into the ocean bed! This is when Vishnu creates a form of a giant turtle out of himself and positions himself under the mountain to support it.Now, the teams were really set to churn the ocean in all seriousness. As it happens with any new endeavor, problems and obstacles come first. So the first product of the churning was the toxic mixture halAhala.It spread in the ocean and its fumes filled the air, choking and blinding the teams, and killing thousands of creatures. Lord Shiva stepped in and rescued everyone by drinking up the poison. This is when he got his name viShakaNTha, nIlakaNTha, shithikaNTha, etc.With the poison cleared, the teams of devas and asuras continued to churn for a long time. Finally, good things started to come out of the ocean.Celestial weapons, divine animals, goddess of liquor (whom the asuras asked to be with), divine trees, divine flower, gems, goddess Lakshmi (who chose to be with Vishnu).At the end, the divine doctor dhanvantari came out holding the golden pot filled with the nectar.As soon as the asuras saw dhanvantari, they forgot everything about their pact with the devas and snatched the pot from him.As the devas looked to Vishnu for what to do next, Vishnu gave them a reassuring nod and gestured to them to remain calm.Next, Vishnu creates another form, that of the bewitchingly beautiful woman mohini. She begins to dance in a most sensuous manner, and as the asuras hear and see her, they fall into a mesmerizing trance, and hand over the pot of nectar to her. She tells them that she will distribute the nectar to everyone, and asks the devas and asuras to sit in two rows.As was planned, she starts pouring out the nectar to the devas, and the asuras are waiting patiently. She is trying to make sure that the pot becomes empty by the end of the row of devas, so that the asuras don’t get any nectar. Only the asura rAhu suspects this and quietly slips away from the asura line and hides behind the devas. As mohini continues to pass by each deva, rahu also receives some nectar into his bowl.However, as he is drinking it, sUrya (sun) and candra (moon) discover him and point him out to mohini.Quick as lightning, she releases the sudarshana cakra to cut off his head before the nectar can go down his throat. But he is still able to retain the nectar that he drank in his head and this is how rAhu’s head became immortal. From then on, rAhu swore eternal vengeance on sUrya and candra, and even to this day we see him swallow up the sun and the moon during their eclipses. In the end, all the devas drink up the nectar, leaving nothing for the asuras. With their new strength, they defeat the asuras and regain their heavenly kingdom.",
        "moral": "Moral"
    },
    {
        "title": "The Squirrel's Dedication",
        "description": "The three white stripes that we see on the back of a squirrel are believed to be the marks of Lord Rama's fingers. Click to know more about it..",
        "story": "Ramayana is not just a mythological book but it's a medium of teaching values to young generations. The book is full of incidents and stories that kids can enjoy them for many days and can learn basic ethics. Few stories are well known but there are stories which are not very popular but are very touching and inspiring. One such story is presented here : -     While making the bridge over the sea to connect to Lanka for fighting the war with Ravana, all the monkey and bear warriors started picking and placing the boulders into the sea. A squirrel was also picking up little pebbles in her mouth and putting it alongside the boulders. She was found by a monkey who started making mockery of her and told to stay away as she will die if she comes under the boulder or the leg of any army. Squirrel was in tears and hurt. Lord Rama realized this and came near the squirrel. To appreciate and show the gesture for the contributions that squirrel made Rama gently stroked the squirrel’s back with his hand. When he raised his hand, the marks of his fingers came up on the body of squirrel in the form of brown fur. And ever since then the squirrel has carried three white stripes on her back, as a token of Rama`s affection.Isn't it amazing?? Squirrel, such a small creatures of this world, had its contribution in building the huge bridge. Through this bridge only, Ram could go to Lanka and can defeat the evil Ravana. This story gives a big life lesson, lesson of not underestimating ourselves. Even smallest good act from us, can make a big effect. Whether this act is for family welfare or for society, we should never think ourselves small. Remember the saying “Little drops make the mighty ocean”. The story also tells us about the humbleness of Lord Ram. He recognized the contribution of little squirrel and acknowledged it. We normally think our tiny good work goes unnoticed but we should take lesson from this story that someday those tiny good deeds can give one recognition and appreciation.If you can’t do great things, do small things in great way.",
        "moral": "Moral"
    },
    {
        "title": "Why is Hanuman ji worshipped by sindoor?",
        "description": "Shri Hanuman is always seen adorned with sindoor all his body. But, behind this sindoori colour is a beautiful story which depicts the devotion of Hanuman for Shri Ram.",
        "story": "After the great battle of Lanka, Shri Ram came to Ayodhya along with Mata Sita and Lakshman and was received with great happiness by his mothers, brothers and people of Ayodhya. Shri Ram was crowned as the king of Ayodhya and all the three worlds rejoiced with joy. Sugriv, Vibhishan and all other friends of Shri Ram stayed at Ayodhya for some time enjoying the festivities and later went back to their respective kingdoms. But, Hanuman who could not bear the separation from his swami even for a minute stayed back at Ayodhya with Shri Ram and Mata Sita. In Ayodhya, along with Lakshman, Bharat and Shatrughan, Hanuman devoted himself into the service of Shri Ram and spent all day looking after his needs. There was never a minute that he left his side in the whole day. Mata Sita rejoiced with Hanuman’s service and looked after him as her son. Thus Hanuman kept the entire royal palace immensely happy with his unconditional service and devotion towards Shri Ram and Mata Sita. Hanuman as a son was quite free to come and go in the palace of Shri Ram and Mata Sita. One day, as part of his daily routine. Hanuman came to the chamber of Shri Ram and Mata Sita to start his day by taking their blessings. When he enters the chamber, he saw Mata Sita applying a dot of sindoor in her forehead (a ritual followed by married woman). Hanuman wonders as to why does she do that and asks her the reason for applying sindoor on her forehead. Mata Sita smiles and says to Hanuman that she does that for her husband to have a long life with health and prosperity. Hanuman falls in deep thought with this. Suddenly an idea strikes him and he leaves the chamber without saying a word to anybody. As usual when Shri Ram is ready to go to the court he finds Hanuman missing. He is surprised and enquires as to where did Hanuman go, as there is never a day without Hanuman beside Shri Ram. All start searching in the whole palace, but he is nowehere to be found.After sometime, Hanuman comes to Shri Ram for his daily service, but with sindoor all over his body. Shri Ram is surprised to see that Hanuman in this strange way and asks him the reason for the same. Hanuman mentions that if a tiny dot of sindoor on Mata Sita’s forehead could give long life to Shri Ram, then how much a whole body dipped in could sindoor would do good to Shri Ram. For this reason, he has applied sindoor all over his body.Shri Ram is mighty pleased with his dear devotee’s ardent love and affection for him. With eyes filled with happiness, Shri Ram blesses Hanuman and grants him a boon that whoever would worship Hanuman with sindoor would be blessed by Shri Ram’s eternal devotion and favour. Since then, it has been a practise to worship Shri Hanuman with sindoor and seeking the benevolence of both the swami and his devotee.",
        "moral": "Moral"
    },
    {
        "title": "Dhruv, the Little Boy Who Became the Pole Star",
        "description":"India is a land of a number of legends and stories. Each story teaches us a different lesson and guides us towards a different way of living. One such legend is of Dhruva, who was a devotee of Lord Vishnu.",
        "story":"Little Dhruv was five year old son of King Uttampada and queen Suniti of Bharatavarsha l, also grandson of King Manu. The king also had other son whose name was Uttama, he was son of king’s second wife Suruchi. As per the tradition during that time, elder son inherits the throne, so Dhruv was the heir to the throne. But queen Suruchi had other plans, she did not leave any stone unturned to make all efforts to make Uttama the king and get Dhruv out of the way. Suruchi’s disdain for Dhruv deeply hurt him one day when Dhruv was sitting on his father’s lap, Suruchi insisted that uttama should sit on his lap instead of Dhruv & the king obliged. Young and sensitive Dhruv was hurt deeply, he asked Suruchi to mend her ways and give him his rightful place but she replied ” Go and ask Bhagvan Vishnu about place for you to sit, he can only help you. There is no place for you here on King’s lap” Little but determined kid Dhruv went to the jungle away from the kingdom and started a strong penance. Very soon his strong penance was noticed by Narada Muni. He conveyed this to Bhagvan Vishnu. After lot many months and days, one day Bhagvan Vishnu came to earth with his Garud Vahana and appeared in his divine form in front of the Dhruv. Dhruv’s joy knew no bounds after seeing Bhagvan. Bhagvan told him he was very happy with his penance and can ask for anything that he wants. Little kid Dhruv was awestruck and could not speak anything. Loss of personal desire is precursor to reaching nirvana in Hindu mythology . Bhagvan Vishnu with his infinite wisdom understood Dhruv’s original desire and granted him a wish – you will have permanent place in my cosmic universe and will not be disturbed even by the maha pralay. Young Dhruv who was not given place on his father’s lap ended up getting a permanent place on the creator of the universe’s lap. This is how we got our Dhruv tara (Pole Star) shining in the sky. It’s so amazing how Indian mythology weaves elements of our daily lives into the grand scheme of things. We have a story for the ever shining star as well as flowing river. Divinity is not exclusive to the gods, it is everywhere. Dhruv Tara is an ever shining star in the sky. Sailors who used to get lost in the sea before the advent of all the technolgy, used to look for this star in the sky to get sense of direction. Dhruv tara was their guiding star in the troubled times which kept their hope alive!",
        "moral": "Moral"
    }
]